RU/Files/day2-1/Problem-class-1/case-4/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value		uniform 1e-3;
    }
    
    outlet
    {
        type            zeroGradient;
    }

    cube-walls
    {
        type            kqRWallFunction;
        value           uniform 1e-3;
    }
    
    tube-walls
    {
        type            slip;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
